app/Http/Controllers/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('edilbert', 'casa@casa.com', '$2y$10$/3oZFea2OmRy87QrZgmM7uWmtojys4UPm4Bb3p39HX.J8R/7WjMLG', '2023-05-28 00:44:59', '2023-05-28 00:44:59')
---
    public function register(Request $request): \Illuminate\Foundation\Application|\Illuminate\Http\Response|\Illuminate\Contracts\Foundation\Application|\Illuminate\Contracts\Routing\ResponseFactory
    {
        $fields = $request->validate(array(
            'name'=>'required|string',
            'email'=>'required|string|unique:users,email',
            'password'=>'required|string|confirmed'
        ));
        $user = User::create([
            'name'=>$fields['name'],
            'email'=>$fields['email'],
            'password'=>password_hash($fields['password'],PASSWORD_DEFAULT)
        ]);

select * from `users` where `email` = '\"casa@gmail.com\"' limit 1
---
        public function login(Request $request)
        {
            $fields = $request->validate([
                'email'=>'required|string',
                'password'=>'required|string'
            ]);
            $user = User::where('email',$fields['email'])->first();