app/Http/Controllers/LivroController.php

select * from `livros`
---
    public function index()
    {
        return Livro::all();

insert into `livros` (`posicao`, `nome`, `abreviacao`, `testamento_id`, `updated_at`, `created_at`) values ('1', '\"cartas de paulo para joão\"', '\"cartas de joao\"', '1', '2023-05-28 00:56:12', '2023-05-28 00:56:12')
---
    public function store(Request $request)
    {
        return Livro::create($request->all());