app/Http/Controllers/TestamentoController.php

    public function index()
    {
        return Testamento::all();
---
select * from `testamentos`

    public function store(Request $request)
    {
        if(Testamento::create($request->all())){
---
insert into `testamentos` (`nome`, `updated_at`, `created_at`) values ('velho testamento', '2023-05-28 00:51:46', '2023-05-28 00:51:46')