app/Http/Controllers/VersiculoController.php

    public function  index()
    {
        return Versiculo::all();
---
select * from `versiculos`

    public function store(Request $request)
    {
        if(Versiculo::create($request->all())){
---
insert into `versiculos` (`capitulo`, `versiculo`, `texto`, `livro_id`, `updated_at`, `created_at`) values ('1', '1', '\"No princípio era o Verbo, e o Verbo estava com Deus, e o Verbo era Deus.\"', '1', '2023-05-28 01:00:57', '2023-05-28 01:00:57')